tests/app/models/Doctor.php

SELECT `easyii_doctor`.`id` AS `doc_id`, `easyii_doctor_lang`.`position`, `easyii_doctor_lang`.`name`, `easyii_doctor_lang`.`slug`, `easyii_user`.`image`, `easyii_user`.`id` AS `us_id` FROM `easyii_doctor` LEFT JOIN `easyii_doctor_lang` ON easyii_doctor_lang.doctor_id = easyii_doctor.id LEFT JOIN `easyii_user` ON easyii_user.id = easyii_doctor.user_id WHERE ((`easyii_doctor`.`status`=1) AND (`language`='az')) AND (`show_in_home` LIKE '%%') ORDER BY `easyii_doctor_lang`.`name`
---
    public static function getDoctors($limit = '', $home = '')
    {
        return parent::find()
            ->select('
                easyii_doctor.id as doc_id,
                easyii_doctor_lang.position,
                easyii_doctor_lang.name,
                easyii_doctor_lang.slug,
                easyii_user.image,
                easyii_user.id as us_id
            ')
            ->leftJoin('easyii_doctor_lang', 'easyii_doctor_lang.doctor_id = easyii_doctor.id')
            ->leftJoin('easyii_user', 'easyii_user.id = easyii_doctor.user_id')
            ->where([
                'easyii_doctor.status' => 1,
                'language' => yii::$app->language,
            ])
            ->andWhere(['like', 'show_in_home', $home])
            ->limit($limit)
            ->orderBy('easyii_doctor_lang.name ASC')
            ->asArray()
            ->all();