tests/app/components/Init.php

SELECT `page_id` FROM `easyii_pages_lang` WHERE `slug`='about-us'
---
    public static function init($event)
    {
        $lang = yii::$app->language;

        setlocale(LC_ALL, $lang.'_'.strtoupper($lang).'utf8');
        date_default_timezone_set('Asia/Baku');

        yii::$container->set('yii\widgets\MaskedInput', [
                'clientOptions'=>[
                    'clearIncomplete'=>true
                ]
        ]);

        $controller = yii::$app->controller;

        $session = yii::$app->session;

        $session->remove('page_id');

        if($slug = yii::$app->request->get('page_slug'))
        {
            $page_id = (new yii\db\Query())
                ->select(['page_id'])
                ->from('easyii_pages_lang')
                ->where(['slug' => $slug])
                ->one();

SELECT `easyii_pages`.`parent_id`, `easyii_pages_lang`.`title`, `easyii_pages_lang`.`short`, `easyii_pages_lang`.`text` FROM `easyii_pages` LEFT JOIN `easyii_pages_lang` ON easyii_pages.id = easyii_pages_lang.page_id WHERE (`easyii_pages`.`id`=FALSE) AND (`easyii_pages_lang`.`language`='az')
---

        if(isset($page_id)) {

            $page = Page::find()
                ->select('
                easyii_pages.parent_id,
                easyii_pages_lang.title,
                easyii_pages_lang.short,
                easyii_pages_lang.text,
            ')
                ->leftJoin('easyii_pages_lang', 'easyii_pages.id = easyii_pages_lang.page_id')
                ->where([
                    'easyii_pages.id' => $page_id,
                    'easyii_pages_lang.language' => yii::$app->language
                ])
                ->asArray()
                ->one();